IDEA Open Model
ProjectData Class
Compatible with IDEA StatiCa Beta 20.0
 Defines certain data about user project.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.ProjectData
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public sealed class ProjectData : OpenObject
Public NotInheritable Class ProjectData
	Inherits OpenObject
The ProjectData type exposes the following members.
Constructors
Name | Description
ProjectData
Initializes a new instance of the ProjectData class
Top
Properties
Name | Description
Author
 Gets or sets the project author.
CodeDependentData
 Code dependent data
Date
 Gets or sets the date.
Description
 Gets or sets the description of project.
Name
 Gets or sets the name of project.
Number
 Gets or sets the number of project.
Top
See Also
Reference
IdeaRS.OpenModel Namespace